/* ************************************************************************** */
/*                                                                            */
/*                                                        _____    ______     */
/*   errorer.c                                           (____ \  |  ___ \    */
/*                                                        _   \ \ | | _ | |   */
/*   By: dmaznytskyi <dmaznytskyi@gmail.com>             | |   | || || || |   */
/*                                                       | |__/ / | || || |   */
/*   Created: 2016/11/01 04:39:39 by dmaznytskyi         |_____/  |_||_||_|   */
/*   Updated: 2016/11/01 20:15:59 by dmaznytskyi                              */
/*                                                                            */
/* ************************************************************************** */

#include "header.h"

void	errorer(int code)
{
	switch (code)
	{
		case 1:
			printf("Трикутник НЕ ІСНУЄ!\n");
			break;
		case 2:
			printf("Введені сторони трикутника не можуть бути менші або рівні нулю.\n");
			break;
		case 3: printf("\nВы ввели текст! Надо ввести число!\n"); break;
		case 4:
			printf("Спробуйте ввести правильні значення!\n\n");
			break;
	}
}
