/* ************************************************************************** */
/*                                                                            */
/*                                                        _____    ______     */
/*   error.c                                             (____ \  |  ___ \    */
/*                                                        _   \ \ | | _ | |   */
/*   By: dmaznytskyi <dmaznytskyi@gmail.com>             | |   | || || || |   */
/*                                                       | |__/ / | || || |   */
/*   Created: 2016/11/03 02:30:17 by dmaznytskyi         |_____/  |_||_||_|   */
/*   Updated: 2017/01/15 21:07:13 by dmaznytskyi                              */
/*                                                                            */
/* ************************************************************************** */

#include "header.h"

// 1 - 9 : input/output errors
// 10 - 19 : errors for the first task
// 20 - 29 : errors for the second task
// 30 - 39 : errors for the third task

void	error(int code)
{
	switch (code)
	{
		case 1:
			printf("\n"LRED">>> ПОМИЛКА <<<"NC" Ви ввели текст! Потрiбно ввести число!\n");
			break ;
		case 2:
			printf("\n"LRED">>> ПОМИЛКА <<<"NC" Програма перервана з причини некоректного вводу.\n");
			break ;
		case 3:
			printf("\n"LRED">>> ПОМИЛКА <<<"NC" Ви ввели 0! Потрiбно ввести ненульве число!\n");
			break ;
		case 4:
			printf("\n"LRED">>> ПОМИЛКА <<<"NC" Введено невiрний номер пiдпрограми! Спробуйте ще раз!\n\n");
			break ;
		case 5:
			printf("\n"LRED">>> ПОМИЛКА <<<"NC" Допустима точність обчислень від 0 до 6!");
			break ;
		case 6:
			printf("\n"LRED">>> ПОМИЛКА <<<"NC" Сталася помилка під час виділення пам'яті!");
			break ;
		case 11:
			printf("\n"LRED">>> ПОМИЛКА <<<"NC" Мінімальна і максимальна частота мусять відрізнятися!\n");
			break ;
		case 12:
			printf("\n"LRED">>> ПОМИЛКА <<<"NC" Мінімальна частота повинна бути менше за максимальну, а крок зміни частоти має бути більше нуля!\n");
			break ;
		case 13:
			printf("\n"LRED">>> ПОМИЛКА <<<"NC" Мінімальна частота повинна бути більше за максимальну, а крок мусить бути менше нуля!\n");
	}
}
